testdata/IN_2023_02/Roundtrip/partner/20151016_vn_firma_2023_02b.xml_request_2023_02b.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <tarif:getQuote xmlns:allg="http://www.bipro.net/namespace/allgemein" xmlns:basis="http://www.bipro.net/namespace/basis" xmlns:dt="http://www.bipro.net/namespace/datentypen" xmlns:gevo="http://www.bipro.net/namespace/gevo" xmlns:nachr="http://www.bipro.net/namespace/nachrichten" xmlns:partner="http://www.bipro.net/namespace/partner" xmlns:pm="http://www.bipro.net/namespace/produktmodell" xmlns:pm-leben="http://www.bipro.net/namespace/versicherung/produktmodell/leben" xmlns:tarif="http://www.bipro.net/namespace/versicherung/tarifierung" xmlns:vbl="urn:de:vb:bipro:taa:leben:1.12" xmlns:vs-pm="http://www.bipro.net/namespace/versicherung/produktmodell" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        
      <tarif:Request>
            
        <nachr:BiPROVersion>2.4.6.1.12</nachr:BiPROVersion>
        <nachr:ConsumerID>WS DEV TEAM</nachr:ConsumerID>
            
        <tarif:Tarifierung>
                
          <gevo:Vermittler>
                    
            <allg:Vermittlernummer>111/222</allg:Vermittlernummer>
                    
            <allg:PartnerID>1</allg:PartnerID>
                  
          </gevo:Vermittler>
                
          <tarif:Partner xsi:type="partner:CT_Person">
                    
            <partner:PartnerID>1</partner:PartnerID>
                  
          </tarif:Partner>
                
          <tarif:Partner xsi:type="partner:CT_Person">
                    
            <partner:Anrede>1</partner:Anrede>
                    
            <partner:PartnerID>2</partner:PartnerID>
                    
            <partner:Geburtsdatum>1992-11-01</partner:Geburtsdatum>
                    
            <partner:Berufstaetigkeit>
                        
              <partner:Beruf>Werbeberater,in</partner:Beruf>
                        
              <partner:StellungImBeruf xsi:type="vbl:STE_StellungImBerufErweitert">Akademiker</partner:StellungImBeruf>
                        
              <partner:NichtKoerperlichTaetig>70</partner:NichtKoerperlichTaetig>
                      
            </partner:Berufstaetigkeit>
                    
            <partner:Ausbildung>
                        
              <partner:ArtID xsi:type="dt:STE_AusbildungsartBasis">Studium</partner:ArtID>
                      
            </partner:Ausbildung>
                  
          </tarif:Partner>
                
          <tarif:Partner xsi:type="partner:CT_JuristischePerson">
                    
            <partner:Anrede>1</partner:Anrede>
                    
            <partner:PartnerID>3</partner:PartnerID>
                  
          </tarif:Partner>
                
          <tarif:Versicherungsnehmer>
                    
            <partner:PartnerID>3</partner:PartnerID>
                  
          </tarif:Versicherungsnehmer>
                
          <tarif:Verkaufsprodukt>
                    
            <pm:Produkt xsi:type="pm-leben:CT_Produkt">
                        
              <basis:Erweiterung xsi:type="vbl:CT_ProduktErweiterung">
                            
                <vbl:Tarifgruppe>Normal</vbl:Tarifgruppe>
                          
              </basis:Erweiterung>
                        
              <pm:GewuenschteZahlungsweise>8</pm:GewuenschteZahlungsweise>
                        
              <pm:Beitrag>
                            
                <pm:ArtID xsi:type="dt:STE_BeitragBasis">01</pm:ArtID>
                            
                <pm:Betrag>
                                
                  <allg:Betrag>150</allg:Betrag>
                                
                  <allg:Waehrung>EUR</allg:Waehrung>
                              
                </pm:Betrag>
                            
                <pm:Zahlungsweise>8</pm:Zahlungsweise>
                          
              </pm:Beitrag>
                        
              <pm:Versicherungsdauer>
                            
                <allg:Beginn>2023-03-01T12:00</allg:Beginn>
                          
              </pm:Versicherungsdauer>
                        
              <pm:Kennung>BIR</pm:Kennung>
                        
              <pm:Elementarprodukt xsi:type="pm-leben:CT_Rente">
                            
                <pm:Versicherungsdauer>
                                
                  <allg:AnzahlJahre>35</allg:AnzahlJahre>
                              
                </pm:Versicherungsdauer>
                            
                <pm-leben:IstHauptversicherung>true</pm-leben:IstHauptversicherung>
                            
                <pm-leben:VersichertePerson>
                                
                  <partner:PartnerID>2</partner:PartnerID>
                              
                </pm-leben:VersichertePerson>
                          
              </pm:Elementarprodukt>
                        
              <pm:Elementarprodukt xsi:type="pm-leben:CT_ArbeitskraftAbsicherung">
                            
                <vs-pm:VersicherungssummeOderLeistung>
                                
                  <vs-pm:ArtID xsi:type="dt:STE_VersicherungssummeOderLeistungBasis">GarantierteRente</vs-pm:ArtID>
                                
                  <vs-pm:Wert>500</vs-pm:Wert>
                                
                  <vs-pm:Werteinheit>20</vs-pm:Werteinheit>
                                
                  <vs-pm:Waehrung>EUR</vs-pm:Waehrung>
                              
                </vs-pm:VersicherungssummeOderLeistung>
                            
                <pm-leben:IstHauptversicherung>false</pm-leben:IstHauptversicherung>
                            
                <pm-leben:VersichertePerson>
                                
                  <partner:PartnerID>2</partner:PartnerID>
                              
                </pm-leben:VersichertePerson>
                            
                <pm-leben:Art xsi:type="dt:STE_UnfaehigkeitsZusatzArtBasis">Rente</pm-leben:Art>
                            
                <pm-leben:Auspraegung xsi:type="dt:STE_UnfaehigkeitsZusatzAuspraegungBasis">BU</pm-leben:Auspraegung>
                          
              </pm:Elementarprodukt>
                        
              <pm-leben:VorgabeBerechnung>
                            
                <pm-leben:ArtID xsi:type="dt:STE_VorgabeBerechnungBasis">Bruttobeitrag</pm-leben:ArtID>
                            
                <pm-leben:Kontext xsi:type="dt:STE_VorgabeBerechnungKontextBasis">Produkt</pm-leben:Kontext>
                          
              </pm-leben:VorgabeBerechnung>
                      
            </pm:Produkt>
                  
          </tarif:Verkaufsprodukt>
              
        </tarif:Tarifierung>
          
      </tarif:Request>
      
    </tarif:getQuote>
  </soapenv:Body>
</soapenv:Envelope>
